{
  "name": "Iago Mosquera",
  "jobtitle": "Application Systems Engineer, Full-stack developer",
  "blurb": "I am an applications developer with a degree in Computer Science. I greatly enjoy designing and developing systems and I'm always on the look out for new technologies and tools to refine my workflow. I have extensive experience building full stack web services, both traditional and microservice-based backends in Python and frontends in TypeScript/React. I've also acted as a Scrum master for a team of over 7 members. I have collaborated within several international teams with members of multiple nationalities and backgrounds, and have remote teamwork experience.",
  "contact": {
    "email": "flackon@gmail.com",
    "tlf": "(+46) 709 188 258",
    "homepage": "philomathy.net",
    "location": "Stockholm, Sweden (willing to relocate to Dublin)"
  },
  "experience_start": "2013-10-01",
  "skills": [
    {
      "title": "Programming",
      "content": [
        {
          "name": "Python 3",
          "lvl": 5
        },
        {
          "name": "JavaScript",
          "lvl": 5
        },
        {
          "name": "TypeScript",
          "lvl": 4
        },
        {
          "name": "Java",
          "lvl": 3
        },
        {
          "name": "Rust",
          "lvl": 1
        }
      ]
    },
    {
      "title": "Languages",
      "content": [
        {
          "name": "Spanish",
          "lvl": 5
        },
        {
          "name": "English",
          "lvl": 5
        },
        {
          "name": "Swedish",
          "lvl": 2
        }
      ]
    }
  ],
  "unranked": [
    {
      "title": "Technologies",
      "content": ["HTML5", "CSS3", "NoSQL", "SASS/SCSS", "GraphQL"]
    },
    {
      "title": "Software & tools",
      "content": ["Docker", "Webpack", "Jest", "MongoDB", "RabbitMQ"]
    },
    {
      "title": "Frameworks & libraries",
      "content": [
        "React",
        "Redux",
        "Tailwindcss",
        "D3",
        "Gatsby",
        "Vue",
        "SQLAlchemy"
      ]
    },
    {
      "title": "Methodologies",
      "content": ["REST", "Scrum", "Kanban", "Agile", "KM"]
    }
  ],
  "milestones": [
    {
      "title": "Work experience",
      "content": [
        {
          "period": "2021/06 - 2023/02",
          "name": "Emblasoft AB",
          "role": "App developer",
          "blurb": "Sole developer of a single-page application for managing and testing mobile networks. The app consists of a web frontend that generates data files and integrates with Emblasoft's preexisting suite of tools and APIs, unifying them under a single dashboard. Utilized for testing and measuring different indicators of mobile networks and data connections.",
          "competences": [
            "React",
            "JavaScript",
            "REST APIs",
            "Tailwind CSS",
            "JSON",
            "VMEs"
          ]
        },
        {
          "period": "2021/02 - 2021/05",
          "name": "Werlabs",
          "role": "Frontend developer",
          "blurb": "Developer of a React-based appointment booking frontend for a medical system, used a design system built with Tailwind CSS and React functional components.",
          "competences": ["React", "TypeScript"]
        },
        {
          "period": "2020/03 - 2020/12",
          "name": "Ericsson",
          "role": "Devops",
          "blurb": "Developer of the backend of a fault forecasting system consisting of two parts: data collection based on trouble reports and prediction done with machine learning. The solution was created using micro services by a team of three developers and a data scientist.",
          "competences": [
            "Microservice Architecture",
            "Machine Learning",
            "Python",
            "Apache NiFi"
          ]
        },
        {
          "period": "2017/11 - 2019/12",
          "name": "Ericsson",
          "role": "Full-stack developer",
          "blurb": "Responsible for development of a data analytics solution for Ericsson's Continuous Integration messaging infrastructure. The solution collects build data and then extracts useful insights from it, to be displayed as an overview for the end user. Part of a small team, I helped define and implement the planning and architecture. The solution consists of a web frontend, a backend API with MongoDB and data collection and processing applications",
          "competences": [
            "Big Data",
            "Python 3",
            "JavaScript",
            "MongoDB",
            "React",
            "D3.js",
            "SASS",
            "RabbitMQ"
          ]
        },
        {
          "period": "2017",
          "name": "Skyresponse",
          "role": "Developer",
          "blurb": "Implemented a connector extension in Javascript between the Skyresponse alarm tracking & managing system API and the IoT development platform ThingWorx by PTC. The extension allows ThingWorx developers to use the alarm services of Skyresponse within the ThingWorx platform via integration with a RESTful API",
          "competences": ["IoT Architecture", "REST", "JavaScript"]
        },
        {
          "period": "2016/11 - 2017/07",
          "name": "Giesecke & Devrient",
          "role": "Scrum Master",
          "blurb": "Worked as scrum master combined with part-time developer responsibilities for a medium size team (7-12 people), comprising both internal employees and consultants. Responsible for driving the sprint demos and retrospectives, as well as assisting the PO with sprint planning and backlog refinement.",
          "competences": ["Scrum", "Agile"]
        },
        {
          "period": "2013/09 - 2017/07",
          "name": "Giesecke & Devrient",
          "role": "Developer",
          "blurb": "Contributed in the development of a system to manage mobile subscriptions for SIM cards geared to embedded, machine to machine use cases. Implementation of a backend server architecture consisting of Spring boot servers running in Docker containers, and using Couchbase as a NoSQL datastore",
          "competences": [
            "Java",
            "Docker",
            "Couchbase",
            "Spring Boot",
            "Jenkins"
          ]
        }
      ]
    },
    {
      "title": "Education",
      "content": [
        {
          "period": "2012",
          "name": "Degree in Computer Science",
          "blurb": "Bachelor’s degree in Computer Science: Technical systems engineering from Universidad de Santiago de Compostela"
        },
        {
          "period": "2012",
          "name": "Exchange studies",
          "blurb": "Studies abroad as part of the ERASMUS exchange programme at Politechnika Gdańska (Gdańsk University of Technology) in Gdańsk, Poland"
        },
        {
          "period": "2014",
          "name": "Videogame creation with Unity",
          "blurb": "Course in videogame creation with Unity by SEAS, (Estudios Superiores Abiertos)"
        }
      ]
    }
  ],
  "adds": [
    {
      "title": "Certificates",
      "content": ["Scrum Master by Scrum Alliance"]
    }
  ]
}
